Tekla Open API Reference for Tekla Structures 2025
UserPropertyItem.FieldType Property
 The field type of the user property.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public UserPropertyFieldTypeEnum FieldType { get; set; }
Public Property FieldType As UserPropertyFieldTypeEnum
	Get
	Set
Property Value
Type: UserPropertyFieldTypeEnum
See Also
Reference
UserPropertyItem Class
Tekla.Structures.Catalogs Namespace